import 'package:flutter/material.dart';
import 'package:myapp1/main.dart';

class firstPage3 extends StatefulWidget {
  @override
  _firstPageState3 createState() => _firstPageState3();
}

class _firstPageState3 extends State<firstPage3> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.yellow[100],
        title: Text("The Godfather"),
      ),
      backgroundColor: Colors.white,
      body: SingleChildScrollView(
        child: Stack(
          children: [
            Container(
              child: Column(children: <Widget>[
                Image.asset(
                  'images/godfather.jpg',
                  height: 300,
                ),
              ]),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 270, left: 30, right: 30),
              child: Column(
                children: [
                  Text("The Godfather"),
                  Text(""),
                  Text(
                      "The Godfather คือหนังยอดเยี่ยม Top 5 ของแทบทุกสำนักโหวตแบบไม่มีข้อกังหาใด ๆ ความยอดเยี่ยมของเนื้อเรื่องที่สร้างจากนิยายอาชญากรรมที่โดยส่วนตัวผมยกให้เป็นอมตะอันดับหนึ่งของโลก บทหนังที่ยอดเยี่ยม ข้อคิดจากตัวละครต่าง ๆ เปรียบเสมือนดูสามก๊กฉบับตะวันตก The Godfather ภาคแรกหยิบส่วนหนึ่งของนิยายมานำเสนอครับ เป็นในส่วนของดอนวีโต้หรือท่านก๊อดฟาเธอร์หัวหน้าครอบครัวมาเฟียใหญ่ในนิว ยอร์กกำลังมองหาลูกชายที่เหมาะสมจะมาสืบทอดตำแหน่งของเขา ลูกชายคนโตก็ใจร้อนวู่วาม ลูกชายคนกลางก็บุคลิกไม่เหมาะสม ส่วนคนเล็กที่เหมือนดอนวีโต้ก็ดันไม่สนใจธุรกิจครอบครัว จนมาเกิดเรื่องเมื่อครอบครัวมาเฟียใหญ่รายอื่นสนใจจะมีเอี่ยวในธุรกิจยาเสพติดแต่ต้องขอความช่วยเหลือเส้นสายศาลและนักการเมืองจากท้านดอนวีโต้ ซึ่งท่านดอนวีโต้ไม่สนใจจะข้องเกี่ยวกับยาเสพติดครับ ถ้าถามถึงความยอดเยี่ยมของ The Godfather ผมว่ามันคือมหากาพย์ครอบครัวมาเฟียที่ไม่ได้มุ่งไปที่อาชญากรรม ตัวท่านดอนวีโต้เขามองว่าตัวเองไม่สามารถอยู่ในสังคมที่ปราศจากความเป็นธรรม เขาจึงสร้างการปกครองของตัวเองขึ้นมา หนังเรื่องนี้จึงเหมือนพาเราไปดูการปกครองคนว่าเป็นอย่างไร แล้วเมื่อบวกกับลักษณะมาเฟียในหนังมันดูเป็นนักเลง ไม่ใช่อันธพาล ไม่ใช่กุ๊ย มันเลยยิ่งรู้สึกเจ๋งดีครับ ส่วนที่ทำให้หนังเป็นที่จดจำสำหรับผมถือว่าเยอะมาก ตั้งแต่ฉากงานแต่งลูกสาวดอนวีโต้ ฉากฆาตกรรมที่ถอดแบบมาจากหนังเป๊ะเลย ผมประทับใจที่เขาเคารพนิยาย รวมถึงฉากจดที่ดัดแปลงจากนิยายเล็กน้อยแต่ออกมายอดเยี่ยมคลาสสิกด้วยฝีมือการกำกับเปี่ยมด้วยความสามารถของคอปโปล่า ที่สำคัญคือคนที่เคยดูหนังแล้วห้ามพลาดฉบับนิยายเป็นอันขาด หนังสือยังมีรายละเอียดเพิ่มเติมของตัวละครหลายตัว เช่นทอม เฮเจน, จอนนี่ ฟอนเท่น, เนรี และตัวอื่น ๆ อีกมากมาย รวมถึงเหตุผลที่ชัดเจนในหนังถูกเขียนไว้ในหนังสือโดยไม่ต้องตีความเอง เช่นทำไมเฮเจนถึงได้รับความไว้วางใจ ชู้ของซันนี่เป็นยังไง รวมถึงทุกความคิดของดอนวีโต้, ไมเคิล และตัวละครอื่นในเรื่อง ด้วยความที่หนังได้ Mario Puzo คนเขียนนิยายมาร่วมเขียนบทหนังด้วย ทำให้ตัวหนังทำออกมามีความเคารพต้นฉบับสูงมาก สาระสำคัญ จังหวะการเล่าเรื่องในหนังลงตัวมาก ชนิดที่แฟนนิยายยากที่จะไม่ชอบหนังเรื่องนี้ The Godfather คือหนัง Gangster อาชญากรรมอมตะตลอดกาลที่หนังยุคหลังยากจะเทียบจริง ๆ สมราคาหนังอันดับ 1 จากการโหวตของผู้อ่านนิตยสาร Empire และเป็นอันดับ 2 จากการโหวตโดยผู้ใช้งานเว็บ IMDb"
                      ),
                  Text(""),FavoriteWidget(),
                  
                ],
              ),
            )
          ],
        ),
      ),
    );
  }
}